drowe67/codec2-dev/stm32/src/sm1000_main.c
/*! Number of preference images kept */
#define PREFS_IMG_NUM       (2)
/*! Base ROM ID for preferences */
#define PREFS_IMG_BASE      (0)
/*! Minimum serial number */
#define PREFS_SERIAL_MIN    8
/*! Maximum serial number */
#define PREFS_SERIAL_MAX    UINT64_MAX

/*! Preference serial numbers, by slot */
static uint64_t prefs_serial[PREFS_IMG_NUM];

struct tone_gen_t tone_gen;
struct sfx_player_t sfx_player;
struct morse_player_t morse_player;

void SysTick_Handler(void);

/*! Menu item root */
static const struct menu_item_t menu_root;

#define MENU_EVT_NEXT   0x10    /*!< Increment the current item */
#define MENU_EVT_PREV   0x11    /*!< Decrement the current item */
#define MENU_EVT_SELECT 0x20    /*!< Select current item */
#define MENU_EVT_BACK   0x21    /*!< Go back one level */
#define MENU_EVT_EXIT   0x30    /*!< Exit menu */

/*!
 * Software-mix two 16-bit samples.
 */
int16_t software_mix(int16_t a, int16_t b) {
    int32_t s = a + b;
    if (s < INT16_MIN)
        return INT16_MIN;   /* Clip! */
    if (s > INT16_MAX)
        return INT16_MAX;   /* Clip! */
    return s;
}

/*! Compare current serial with oldest and newest */
void compare_prefs(int* const oldest, int* const newest, int idx)
{
    if (newest && prefs_serial[idx]) {
        if ((*newest < 0)
                || (prefs_serial[idx] > prefs_serial[*newest])
                || ((prefs_serial[idx] == PREFS_SERIAL_MIN)
                    && (prefs_serial[*newest] == PREFS_SERIAL_MAX)))
            *newest = idx;
    }

    if (oldest) {
        if ((*oldest < 0)
                || (!prefs_serial[idx])
                || (prefs_serial[idx] < prefs_serial[*oldest])
                || ((prefs_serial[idx] == PREFS_SERIAL_MAX)
                    && (prefs_serial[*oldest] == PREFS_SERIAL_MIN)))
            *oldest = idx;
    }
}

/*! Find oldest and newest images */
void find_prefs(int* const oldest, int* const newest)
{
    int i;
    if (newest) *newest = -1;
    if (oldest) *oldest = -1;
    for (i = 0; i < PREFS_IMG_NUM; i++)
        compare_prefs(oldest, newest, i);
}

/*! Load preferences from flash */
int load_prefs()
{
    struct prefs_t image[PREFS_IMG_NUM];
    int newest = -1;
    int i;

    /* Load all copies into RAM */
    for (i = 0; i < PREFS_IMG_NUM; i++) {
        int res = vrom_read(PREFS_IMG_BASE + i, 0,
                sizeof(image[i]), &image[i]);
        if (res == sizeof(image[i])) {
            prefs_serial[i] = image[i].serial;
            compare_prefs(NULL, &newest, i);
        } else {
            prefs_serial[i] = 0;
        }
    }

    if (newest < 0)
        /* No newest image was found */
        return -ENOENT;

    /* Load from the latest image */
    memcpy(&prefs, &image[newest], sizeof(prefs));
    return 0;
}

int process_core_state_machine(int core_state, struct menu_t  *menu, int *op_mode);

int main(void) {
    struct freedv *f;
    int            nin, nout, i;
    short         *pccm = CCM;
    
    usart_init();
    memtools_find_unused(usart_printf);
    
    /* Menu data */
    struct menu_t   menu;

    /* Outgoing sample counter */
    int spk_nsamples = 0;

    /* Current runtime operation mode */
    int op_mode = ANALOG;

    /* init all the drivers for various peripherals */

    SysTick_Config(SystemCoreClock/1000); /* 1 kHz SysTick */
    sm1000_leds_switches_init();

    /* Enable CRC clock */
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_CRC, ENABLE);

#ifdef __NEW
    /* Briefly open FreeDV 700D to determine buffer sizes we need
       (700D has the largest buffers) */
    f = freedv_open(FREEDV_MODE_700D);
    int n_speech_samples = freedv_get_n_speech_samples(f);
    int n_speech_samples_16k = 2*n_speech_samples;
    int n_modem_samples = freedv_get_n_max_modem_samples(f);
    int n_modem_samples_16k = 2*n_modem_samples;
    freedv_close(f); f = NULL;
    usart_printf("n_speech_samples: %d n_modem_samples: %d\n",
                 n_speech_samples, n_modem_samples);

    /* both speech and modem buffers will be about the same size, but
       choose the largest and add a little extra padding */
    int n_samples_16k;
    if (n_speech_samples_16k > n_modem_samples_16k)
        n_samples_16k = n_speech_samples_16k;
    else
        n_samples_16k = n_modem_samples_16k;
    n_samples_16k += FORTY_MS_16K;

    usart_printf("n_samples_16k: %d storage for 4 FIFOs: %d bytes\n",
                 n_samples_16k, 4*2*n_samples_16k);
    
    /* Set up ADCs/DACs and their FIFOs, note storage is in CCM memory */
    usart_printf("pccm before dac/adc open: %p\n", pccm);
    dac_open(DAC_FS_16KHZ, n_samples_16k, pccm, pccm+n_samples_16k);
    pccm += 2*n_samples_16k;
    adc_open(ADC_FS_16KHZ, n_samples_16k, pccm, pccm+n_samples_16k);
    pccm += 2*n_samples_16k;
    usart_printf("pccm after dac/adc open: %p\n", pccm);
    assert((void*)pccm < CCM+CCM_LEN);
#else
    int n_samples_16k = FORTY_MS_16K;
    int n_speech_samples_16k = FORTY_MS_16K;
    int n_speech_samples =  n_speech_samples_16k/2;
    f = NULL;
    dac_open(DAC_FS_16KHZ, n_samples_16k, 0, 0);
    adc_open(ADC_FS_16KHZ, n_samples_16k, 0, 0);
#endif
    
    /* Some local buffering of samples from ADC/DAC FIFOs used for I/O
       to FreeDV

       Rx: modem samples from the radio are read from ADC1 FIFO into
           adc16k, are resampled to adc8k and passed to freedv for
           demodulation and decoding.  The output speech samples are
           in dac8k, which are resampled to 16k and sent to the
           speaker DAC2.

       Tx: speech samples from the microphone come from ADC2 FIFO to
           adc16k, are resampled to adc8k and passed to freedv for
           encoding and modulation.  The output modem samples are in
           dac8k, which are resampled to 16k and sent to the radio
           DAC1.
    */
    int n_samples = n_samples_16k/2;
    short adc16k[FDMDV_OS_TAPS_16K+n_samples_16k];
    short dac16k[n_samples_16k];
    short adc8k[n_samples];
    short dac8k[FDMDV_OS_TAPS_8K+n_samples];
    int dac_limit = FORTY_MS_16K;

    int adc_dac_buffer_bytes = 2*(FDMDV_OS_TAPS_16K+n_samples_16k
                                  + n_samples_16k
                                  + n_samples
                                  + FDMDV_OS_TAPS_8K+n_samples);
    usart_printf("ADC/DAC buffer bytes: %d\n", adc_dac_buffer_bytes);
    memtools_find_unused(usart_printf);
    
