drowe67/codec2-dev/stm32/src/sm1000_main.c
    /* put GPIOs into a known state */
    led_pwr(1); led_ptt(0); led_rt(0); led_err(0); not_cptt(1);

    /* clear filter memories */
    for(i=0; i<FDMDV_OS_TAPS_16K; i++)
        adc16k[i] = 0.0;
    for(i=0; i<FDMDV_OS_TAPS_8K; i++)
        dac8k[i] = 0.0;

    if (!switch_back()) {
        /* Play tone to acknowledge, wait for release */
        tone_reset(&tone_gen, 1200, 1000);
        while(!switch_back()) {
            int dac_rem = dac2_free();
            if (dac_rem) {
                if (dac_rem > n_samples_16k)
                    dac_rem = n_samples_16k;

                for (i = 0; i < dac_rem; i++)
                    dac16k[i] = tone_next(&tone_gen);
                dac2_write(dac16k, dac_rem, dac_limit);
            }
            if (!menuLEDTicker) {
                menuLEDTicker = MENU_LED_PERIOD;
                led_rt(LED_INV);
            }
        }

        /* Button released, do an EEPROM erase */
        for (i = 0; i < PREFS_IMG_NUM; i++)
            vrom_erase(i + PREFS_IMG_BASE);
    }
    led_rt(LED_OFF);
    tone_reset(&tone_gen, 0, 0);
    tot_reset(&tot);

    usart_printf("loading preferences from flash....\n");

    /* Try to load preferences from flash */
    if (load_prefs() < 0) {
        /* Fail!  Load defaults. */
        memset(&prefs, 0, sizeof(prefs));
        prefs.op_mode = ANALOG;
        prefs.menu_vol = 2;
        prefs.menu_speed = 60;  /* 20 WPM */
        prefs.menu_freq = 800;
        prefs.tot_period = 0; /* Disable time-out timer */
        prefs.tot_warn_period = 15;
    }

    /* Set up time-out timer, 100msec ticks */
    tot.tick_period        = 100;
    tot.remain_warn_ticks  = 10;

    /* Clear out switch states */
    memset(&sw_select, 0, sizeof(sw_select));
    memset(&sw_back, 0, sizeof(sw_back));
    memset(&sw_ptt, 0, sizeof(sw_ptt));

    /* Clear out menu state */
    memset(&menu, 0, sizeof(menu));

    morse_player.freq = prefs.menu_freq;
    morse_player.dit_time = prefs.menu_speed;
    morse_player.msg = NULL;
    op_mode = prefs.op_mode;

    /* play a start-up tune. */
    sfx_play(&sfx_player, sound_startup);

    usart_printf("entering main loop...\n");

    uint32_t lastms = ms;
    int n_nom_modem_samples =0, n_nom_modem_samples_16k = 0;
    
    while(1) {
        /* Read switch states */
        switch_update(&sw_select,   (!switch_select()) ? 1 : 0);
        switch_update(&sw_back,     (!switch_back()) ? 1 : 0);
        switch_update(&sw_ptt,      (switch_ptt() || (!ext_ptt())) ? 1 : 0);

        /* Update time-out timer state */
        tot_update(&tot);

        /* iterate core state machine based on switch events */
        int prev_op_mode = op_mode;
        core_state = process_core_state_machine(core_state, &menu, &op_mode);
        
        /* if mode has changed, re-open freedv */
        if (op_mode != prev_op_mode) {
            usart_printf("Mode change prev_op_mode: %d op_mode: %d\n", prev_op_mode, op_mode);
            if (f) freedv_close(f);
            switch(op_mode) {
            case ANALOG:
                usart_printf("Analog\n");
                n_speech_samples = FORTY_MS_16K/2;
                n_nom_modem_samples = FORTY_MS_16K/2;              
                dac_limit = FORTY_MS_16K;
                break;
            case DV1600:
                usart_printf("FreeDV 1600\n");
                f = freedv_open(FREEDV_MODE_1600);
                assert(f != NULL);
                n_speech_samples = freedv_get_n_speech_samples(f);
                n_nom_modem_samples = freedv_get_n_nom_modem_samples(f);
                /* When running 1600 we don't want too many samples
                   buffered in the rather large DAC FIFOs we have allocated
                   to cater for 700D, so we artificially limit the number
                   of samples we can store in the DAC FIFOs */
                dac_limit = FORTY_MS_16K;
               break;
            case DV700D:
                usart_printf("FreeDV 700D\n");
                f = freedv_open(FREEDV_MODE_700D);
                assert(f != NULL);
                n_speech_samples = freedv_get_n_speech_samples(f);
                n_nom_modem_samples = freedv_get_n_nom_modem_samples(f);
                /* use all of the FIFO size */
                dac_limit = 0;
                break;
            }
            n_speech_samples_16k = 2*n_speech_samples;
            n_nom_modem_samples_16k = 2*n_nom_modem_samples;

            /* empty ADC fifos as a starting point for kicking off new mode */
            usart_printf("Empty ADC FIFOs\n");
            while(adc1_read(&adc16k[FDMDV_OS_TAPS_16K], n_speech_samples_16k) == 0);
            while(adc2_read(&adc16k[FDMDV_OS_TAPS_16K], n_speech_samples_16k) == 0);
        }
        
        /* Acknowledge switch events */
        switch_ack(&sw_select);
        switch_ack(&sw_back);
        switch_ack(&sw_ptt);

        /* perform signal processing based on core state */
        switch (core_state) {
            case STATE_MENU:
                if (!menuLEDTicker) {
                    led_pwr(LED_INV);
                    menuLEDTicker = MENU_LED_PERIOD;
                }
                break;
            case STATE_TX:
                /* Transmit -------------------------------------------------------------------------*/

                /* ADC2 is the SM1000 microphone, DAC1 is the modulator signal we send to radio tx */

                if (adc2_read(&adc16k[FDMDV_OS_TAPS_16K], n_speech_samples_16k) == 0) {
                    GPIOE->ODR = (1 << 3); /* blink GPIO to time processing with an oscilliscope */

                    /* clipping indicator */

                    led_err(0);
                    for (i=0; i<n_samples_16k; i++) {
                        if (abs(adc16k[FDMDV_OS_TAPS_16K+i]) > 28000)
                            led_err(1);
                    }

                    fdmdv_16_to_8_short(adc8k, &adc16k[FDMDV_OS_TAPS_16K], n_speech_samples);

                    if (op_mode == ANALOG) {
                        for(i=0; i<n_speech_samples; i++)
                            dac8k[FDMDV_OS_TAPS_8K+i] = adc8k[i];
                        fdmdv_8_to_16_short(dac16k, &dac8k[FDMDV_OS_TAPS_8K], n_speech_samples);
                        dac1_write(dac16k, n_speech_samples_16k, dac_limit);
                    } else {
                        freedv_tx(f, &dac8k[FDMDV_OS_TAPS_8K], adc8k);
                        for(i=0; i<n_nom_modem_samples; i++)
                            dac8k[FDMDV_OS_TAPS_8K+i] *= 0.398; /* 8dB back off from peak */
                        fdmdv_8_to_16_short(dac16k, &dac8k[FDMDV_OS_TAPS_8K], n_nom_modem_samples);
                        dac1_write(dac16k, n_nom_modem_samples_16k, dac_limit);
                    }

                    led_ptt(1); led_rt(0); led_err(0); not_cptt(0);
                    GPIOE->ODR &= ~(1 << 3);
                }
                break;

            case STATE_RX:
            case STATE_RX_TOT:
                /* Receive --------------------------------------------------------------------------*/

